# Remove Columns from a Pandas DataFrame

In [1]:
import pandas as pd

ufo = pd.read_csv('datasets/uforeports.csv')
ufo.shape

(18241, 5)

In [2]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [3]:
ufo.columns = ufo.columns.str.replace(' ', '_').str.lower()
ufo.head()

                   city colors_reported shape_reported state             time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [4]:
ufo.drop('colors_reported', axis=1, inplace=True)
# or for multiple columns
# ufo.drop(['City', 'State], axis=1, inplace=True)
ufo.head()

                   city shape_reported state             time
0                Ithaca       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          OTHER    NJ  6/30/1930 20:00
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00

# Delete rows from a Pandas DataFrame

In [5]:
ufo.drop([0, 1], axis=0, inplace=True)
ufo.head()

                   city shape_reported state             time
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00
5           Valley City           DISK    ND  9/15/1934 15:30
6           Crater Lake         CIRCLE    CA   6/15/1935 0:00